benchmarks/framework-shootout/results/fastapi/query/run1/wrk_steady.txt
Running 5s test @ http://fastapi:8080/query?q=bench&limit=100&offset=50
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.04ms   15.03ms  59.49ms   81.83%
    Req/Sec     4.47k     0.99k   13.49k    82.09%
  Latency Distribution
     50%    1.61ms
     75%   14.52ms
     90%   37.54ms
     99%   52.20ms
  89426 requests in 5.10s, 13.82MB read
Requests/sec:  17535.41
Transfer/sec:      2.71MB